function convertStringToNumbersInArray(arr) {
    // Проверяем, является ли переданное значение числом
    const isStringNumber = (value) => {
        return !isNaN(value) && !isNaN(parseFloat(value));
    };

    // Рекурсивная функция для обхода всех полей объекта
    const convertHelper = (obj) => {
        // Если obj является объектом, обрабатываем его поля
        if (typeof obj === 'object' && obj !== null) {
            for (let key in obj) {
                // Рекурсивно вызываем функцию для значений полей
                obj[key] = convertHelper(obj[key]);
            }
            return obj;
        } else if (typeof obj === 'string' && isStringNumber(obj)) {
            // Если значение является строкой, представляющей число, преобразуем его в число
            return parseFloat(obj);
        }
        // Если значение не является строкой, оставляем его как есть
        return obj;
    };

    // Проходимся по каждому элементу массива и вызываем рекурсивную функцию для обработки объектов
    for (let i = 0; i < arr.length; i++) {
        arr[i] = convertHelper(arr[i]);
    }

    return arr;
}

let data = [
    {
        "prod": "Apple",
        "Модель": "iPhone 14 Pro Max",
        "sizeOf": 6.7,
        "Матрица": "OLED",
        "maincam": 48,
        "frontcam": 12,
        "Оперативная/встроенная память (Гб)": 1024,
        "Аккумулятор": 4323
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy S22 Ultra",
        "sizeOf": 6.8,
        "Матрица": "AMOLED",
        "maincam": 108,
        "frontcam": 40,
        "Оперативная/встроенная память (Гб)": 1024,
        "Аккумулятор": 5000
    },
    {
        "prod": "Xiaomi",
        "Модель": "12S Ultra",
        "sizeOf": 6.73,
        "Матрица": "AMOLED",
        "maincam": 50,
        "frontcam": 32,
        "Оперативная/встроенная память (Гб)": 512,
        "Аккумулятор": 4860
    },
    {
        "prod": "Google",
        "Модель": "Pixel 7 Pro",
        "sizeOf": 6.7,
        "Матрица": "AMOLED",
        "maincam": 50,
        "frontcam": 10,
        "Оперативная/встроенная память (Гб)": 512,
        "Аккумулятор": 5000
    },
    {
        "prod": "Honor",
        "Модель": "70",
        "sizeOf": 6.67,
        "Матрица": "AMOLED",
        "maincam": 54,
        "frontcam": 32,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 4800
    },
    {
        "prod": "POCO",
        "Модель": "F4 GT",
        "sizeOf": 6.67,
        "Матрица": "AMOLED",
        "maincam": 64,
        "frontcam": 20,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 4700
    },
    {
        "prod": "Huawei",
        "Модель": "Nova 10 Pro",
        "sizeOf": 6.78,
        "Матрица": "Super AMOLED",
        "maincam": 50,
        "frontcam": 60,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 4500
    },
    {
        "prod": "Infinix",
        "Модель": "Note 12 Pro",
        "sizeOf": 6.7,
        "Матрица": "AMOLED",
        "maincam": 108,
        "frontcam": 16,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 5000
    },
    {
        "prod": "Vivo",
        "Модель": "T1",
        "sizeOf": 6.44,
        "Матрица": "AMOLED",
        "maincam": 50,
        "frontcam": 16,
        "Оперативная/встроенная память (Гб)": 128,
        "Аккумулятор": 5000
    },
    {
        "prod": "Realme",
        "Модель": "C31",
        "sizeOf": 6.5,
        "Матрица": "PLS",
        "maincam": 13,
        "frontcam": 5,
        "Оперативная/встроенная память (Гб)": 64,
        "Аккумулятор": 5000
    },
    {
        "prod": "Xiaomi",
        "Модель": "12T Pro",
        "sizeOf": 6.67,
        "Матрица": "AMOLED",
        "maincam": 200,
        "frontcam": 20,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 5000
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy Z Flip3",
        "sizeOf": 6.7,
        "Матрица": "AMOLED",
        "maincam": 12,
        "frontcam": 10,
        "Оперативная/встроенная память (Гб)": 128,
        "Аккумулятор": 3300
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy A33",
        "sizeOf": 6.4,
        "Матрица": "AMOLED",
        "maincam": 48,
        "frontcam": 13,
        "Оперативная/встроенная память (Гб)": 128,
        "Аккумулятор": 5000
    },
    {
        "prod": "Xiaomi",
        "Модель": "Poco M4 Pro",
        "sizeOf": 6.6,
        "Матрица": "IPS",
        "maincam": 50,
        "frontcam": 16,
        "Оперативная/встроенная память (Гб)": 64,
        "Аккумулятор": 5000
    },
    {
        "prod": "Apple",
        "Модель": "iPhone 13",
        "sizeOf": 6.1,
        "Матрица": "OLED",
        "maincam": 12,
        "frontcam": 12,
        "Оперативная/встроенная память (Гб)": 128,
        "Аккумулятор": 3240
    },
    {
        "prod": "Realme",
        "Модель": "GT Master Edition",
        "sizeOf": 6.4,
        "Матрица": "AMOLED",
        "maincam": 64,
        "frontcam": 32,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 4300
    },
    {
        "prod": "Xiaomi",
        "Модель": "11T",
        "sizeOf": 6.67,
        "Матрица": "Super AMOLED",
        "maincam": 108,
        "frontcam": 16,
        "Оперативная/встроенная память (Гб)": 128,
        "Аккумулятор": 5000
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy A52",
        "sizeOf": 6.5,
        "Матрица": "Super AMOLED",
        "maincam": 64,
        "frontcam": 32,
        "Оперативная/встроенная память (Гб)": 128,
        "Аккумулятор": 4500
    },
    {
        "prod": "Xiaomi",
        "Модель": "POCO F3",
        "sizeOf": 6.67,
        "Матрица": "AMOLED",
        "maincam": 48,
        "frontcam": 20,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 4520
    },
    {
        "prod": "Realme",
        "Модель": "9 Pro",
        "sizeOf": 6.6,
        "Матрица": "IPS",
        "maincam": 64,
        "frontcam": 16,
        "Оперативная/встроенная память (Гб)": 128,
        "Аккумулятор": 5000
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy S20 FE",
        "sizeOf": 6.5,
        "Матрица": "Super AMOLED",
        "maincam": 12,
        "frontcam": 32,
        "Оперативная/встроенная память (Гб)": 256,
        "Аккумулятор": 4500
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy A23",
        "sizeOf": 6.5,
        "Матрица": "PLS",
        "maincam": 50,
        "frontcam": 8,
        "Оперативная/встроенная память (Гб)": 64,
        "Аккумулятор": 5000
    },
    {
        "prod": "Realme",
        "Модель": "Narzo 50A",
        "sizeOf": 6.5,
        "Матрица": "IPS",
        "maincam": 50,
        "frontcam": 8,
        "Оперативная/встроенная память (Гб)": 64,
        "Аккумулятор": 5860
    },
    {
        "prod": "Xiaomi",
        "Модель": "Redmi 10C",
        "sizeOf": 6.71,
        "Матрица": "IPS",
        "maincam": 50,
        "frontcam": 5,
        "Оперативная/встроенная память (Гб)": 64,
        "Аккумулятор": 5000
    },
    {
        "prod": "Xiaomi",
        "Модель": "Redmi S2",
        "sizeOf": 5.99,
        "Матрица": "IPS",
        "maincam": 12,
        "frontcam": 16,
        "Оперативная/встроенная память (Гб)": 64,
        "Аккумулятор": 3080
    },
    {
        "prod": "HUAWEI",
        "Модель": "Y5p",
        "sizeOf": "5.45",
        "Матрица": "IPS",
        "maincam": "8",
        "frontcam": "5",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "3080"
    },
    {
        "prod": "DOOGEE",
        "Модель": "S40 Pro",
        "sizeOf": "5.4",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "2",
        "Оперативная/встроенная память (Гб)": "64",
        "Аккумулятор": "3000"
    },
    {
        "prod": "Blackview",
        "Модель": "BV9800 Pro",
        "sizeOf": "6.3",
        "Матрица": "IPS",
        "maincam": "48",
        "frontcam": "16",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "6580"
    },
    {
        "prod": "Caterpillar",
        "Модель": "Cat S61",
        "sizeOf": "5.2",
        "Матрица": "IPS",
        "maincam": "16",
        "frontcam": "8",
        "Оперативная/встроенная память (Гб)": "64",
        "Аккумулятор": "4500"
    },
    {
        "prod": "DOOGEE",
        "Модель": "S97 Pro",
        "sizeOf": "6.39",
        "Матрица": "OLED",
        "maincam": "48",
        "frontcam": "16",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "8500"
    },
    {
        "prod": "Ulefone",
        "Модель": "Power Armor 14",
        "sizeOf": "6.52",
        "Матрица": "IPS",
        "maincam": "20",
        "frontcam": "16",
        "Оперативная/встроенная память (Гб)": "64",
        "Аккумулятор": "10000"
    },
    {
        "prod": "BQ",
        "Модель": "6645L Element",
        "sizeOf": "6.52",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "5",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "4000"
    },
    {
        "prod": "BQ",
        "Модель": "5765L Clever",
        "sizeOf": "5.7",
        "Матрица": "IPS",
        "maincam": "5",
        "frontcam": "2",
        "Оперативная/встроенная память (Гб)": "16",
        "Аккумулятор": "2700"
    },
    {
        "prod": "BQ",
        "Модель": "6630L Magic L",
        "sizeOf": "6.53",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "8",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "4920"
    },
    {
        "prod": "HONOR",
        "Модель": "X8",
        "sizeOf": "6.7",
        "Матрица": "LTPS",
        "maincam": "64",
        "frontcam": "16",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "4000"
    },
    {
        "prod": "Nokia",
        "Модель": "G50",
        "sizeOf": "6.82",
        "Матрица": "IPS",
        "maincam": "48",
        "frontcam": "8",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "5000"
    },
    {
        "prod": "OPPO",
        "Модель": "Reno 5 Lite",
        "sizeOf": "6.43",
        "Матрица": "AMOLED",
        "maincam": "48",
        "frontcam": "32",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "4310"
    },
    {
        "prod": "HUAWEI",
        "Модель": "P20 Pro",
        "sizeOf": "6.1",
        "Матрица": "AMOLED",
        "maincam": "40",
        "frontcam": "24",
        "Оперативная/встроенная память (Гб)": "64",
        "Аккумулятор": "4000"
    },
    {
        "prod": "Xiaomi",
        "Модель": "11 Lite 5G",
        "sizeOf": "6.67",
        "Матрица": "Super AMOLED",
        "maincam": "64",
        "frontcam": "20",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "4250"
    },
    {
        "prod": "BQ",
        "Модель": "6631G Surf",
        "sizeOf": "6.53",
        "Матрица": "IPS",
        "maincam": "8",
        "frontcam": "2",
        "Оперативная/встроенная память (Гб)": "16",
        "Аккумулятор": "3000"
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy A02",
        "sizeOf": "6.5",
        "Матрица": "PLS",
        "maincam": "13",
        "frontcam": "5",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "5000"
    },
    {
        "prod": "Xiaomi",
        "Модель": "Redmi 9A",
        "sizeOf": "6.53",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "5",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "5000"
    },
    {
        "prod": "TCL",
        "Модель": "20E",
        "sizeOf": "6.52",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "5",
        "Оперативная/встроенная память (Гб)": "64",
        "Аккумулятор": "4000"
    },
    {
        "prod": "OPPO",
        "Модель": "A16",
        "sizeOf": "6.52",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "8",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "5000"
    },
    {
        "prod": "Xiaomi",
        "Модель": "Redmi 6A",
        "sizeOf": "5.45",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "5",
        "Оперативная/встроенная память (Гб)": "16",
        "Аккумулятор": "3000"
    },
    {
        "prod": "Xiaomi",
        "Модель": "Redmi 9",
        "sizeOf": "6.53",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "8",
        "Оперативная/встроенная память (Гб)": "64",
        "Аккумулятор": "5020"
    },
    {
        "prod": "Realme",
        "Модель": "C21Y",
        "sizeOf": "6.5",
        "Матрица": "IPS",
        "maincam": "13",
        "frontcam": "5",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "5000"
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy A12",
        "sizeOf": "6.5",
        "Матрица": "PLS",
        "maincam": "48",
        "frontcam": "8",
        "Оперативная/встроенная память (Гб)": "32",
        "Аккумулятор": "5000"
    },
    {
        "prod": "Apple",
        "Модель": "iPhone 13 Pro",
        "sizeOf": "6.1",
        "Матрица": "OLED",
        "maincam": "12",
        "frontcam": "12",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "3240"
    },
    {
        "prod": "Samsung",
        "Модель": "Galaxy A53",
        "sizeOf": "6.5",
        "Матрица": "Super AMOLED",
        "maincam": "64",
        "frontcam": "32",
        "Оперативная/встроенная память (Гб)": "128",
        "Аккумулятор": "5000"
    }
]

data = convertStringToNumbersInArray(data);